In [21]:
from pathlib import Path
import pandas as pd

### Tables for all data files

In [22]:
dept_main = Path("../../data/departments.csv")
dept_main_df = pd.read_csv(dept_main)
dept_main_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [23]:
dept_emp_main = Path("../../data/dept_emp.csv")
dept_emp_main_df = pd.read_csv(dept_emp_main)
dept_emp_main_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [24]:
dept_man_main = Path("../../data/dept_manager.csv")
dept_man_main_df = pd.read_csv(dept_man_main)
dept_man_main_df.head()

  dept_no  emp_no
0    d001  110022
1    d001  110039
2    d002  110085
3    d002  110114
4    d003  110183

In [25]:
employees_main = Path("../../data/employees.csv")
employees_main_df = pd.read_csv(employees_main)
employees_main_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991

In [26]:
salaries_main = Path("../../data/salaries.csv")
salaries_main_df = pd.read_csv(salaries_main)
salaries_main_df.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [27]:
titles_main = Path("../../data/titles.csv")
titles_main_df = pd.read_csv(titles_main)
titles_main_df.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

### Question Table Outputs

Question 1

In [28]:
q1 = Path("Question_1_table.csv")
q1_df= pd.read_csv(q1)
q1_df.head()

   emp_no  last_name first_name sex  salary
0   57444       Babb      Berry   F   48973
1  263976   Cusworth       Eran   M   40000
2  461591   Samarati     Xudong   M   40000
3  477657  Magliocco     Lihong   M   54816
4   29920      Tyugu    Shuichi   F   40000

Question 2

In [29]:
q2 = Path("Question_2_table.csv")
q2_df= pd.read_csv(q2)
q2_df.head()

  first_name last_name   hire_date
0       Eran  Cusworth  1986-11-14
1      Bojan  Zallocco  1986-10-14
2      Nevio    Demizu  1986-05-18
3       Ziva    Vecchi  1986-07-03
4      Mohit     Speek  1986-01-14

Question 3

In [30]:
q3 = Path("Question_3_table.csv")
q3_df= pd.read_csv(q3)
q3_df.head()

     title dept_no        dept_name  emp_no     last_name first_name
0  Manager    d001        Marketing  110022    Markovitch  Margareta
1  Manager    d001        Marketing  110039      Minakawa   Vishwani
2  Manager    d002          Finance  110085         Alpin       Ebru
3  Manager    d002          Finance  110114    Legleitner      Isamu
4  Manager    d003  Human Resources  110183  Ossenbruggen    Shirish

Question 4

In [31]:
q4 = Path("Question_4_table.csv")
q4_df= pd.read_csv(q4)
q4_df.head()

  dept_no  emp_no last_name first_name           dept_name
0    d005   10001   Facello     Georgi         Development
1    d003   10005  Maliniak    Kyoichi     Human Resources
2    d004   10010  Piveteau  Duangkaew          Production
3    d006   10010  Piveteau  Duangkaew  Quality Management
4    d009   10011     Sluis       Mary    Customer Service

Question 5

In [32]:
q5 = Path("Question_5_table.csv")
q5_df= pd.read_csv(q5)
q5_df.head()

  first_name  last_name sex
0   Hercules       Baer   M
1   Hercules      Biron   F
2   Hercules      Birge   F
3   Hercules    Berstel   F
4   Hercules  Bernatsky   M

Question 6

In [33]:
q6 = Path("Question_6_table.csv")
q6_df= pd.read_csv(q6)
q6_df.head()

  dept_name  emp_no last_name first_name
0     Sales  211383    Candan        Uli
1     Sales  496429    Luders   Takanari
2     Sales  219797   Demeyer     Neelam
3     Sales  426193    Rattan     Huiqun
4     Sales   78524      Bahk     Zhiwei

Question 7

In [34]:
q7 = Path("Question_7_table.csv")
q7_df= pd.read_csv(q7)
q7_df.head()

   emp_no        last_name first_name    dept_name
0   98882  Vanwelkenhuysen     Yishay  Development
1   78316           Rahimi    Roselyn  Development
2  401368            Azumi      Vidar  Development
3  211383           Candan        Uli        Sales
4  496429           Luders   Takanari        Sales

Question 8

In [35]:
q8 = Path("Question_8_table.csv")
q8_df= pd.read_csv(q8)
q8_df.head()

  last_name  count
0      Baba    226
1     Coorg    223
2    Gelosh    223
3    Farris    222
4   Sudbeck    222